{
  "term": "Spring",
  "year": "2008",
  "level": [
    "Undergraduate"
  ],
  "topics": [
    [
      "Engineering",
      "Electrical Engineering"
    ],
    [
      "Science",
      "Physics",
      "Electromagnetism"
    ]
  ],
  "legacy_uid": "a12d367b-7ec6-32cf-a454-375b0e0a66f5",
  "instructors": {
    "content": [
      "cc6d813a-ef80-def3-fd07-90720066e417",
      "281bb786-462c-d33d-fa7a-1142ca92c151",
      "563af061-106b-b1e4-e8d2-bc3d6873e258",
      "40402473-91ed-092d-4ee8-976433594ed6"
    ],
    "website": "ocw-www"
  },
  "course_image": {
    "content": "22be3daa-0aa3-3695-3e17-3ab8d8e4a6a5",
    "website": "res-6-001-electromagnetic-fields-and-energy-spring-2008"
  },
  "course_title": "Electromagnetic Fields and Energy",
  "hide_download": true,
  "course_description": "Published in 1989 by Prentice-Hall, this book is a useful resource for educators and self-learners alike. The text is aimed at those who have seen Maxwell's equations in integral and differential form and who have been exposed to some integral theorems and differential operators. A hypertext version of this textbook can be found [here](http://web.mit.edu/6.013_book/www/book.html). An accompanying set of video demonstrations is available below.\n\nThese video demonstrations convey electromagnetism concepts. The demonstrations are related to topics covered in the textbook. They were prepared by Markus Zahn, James R. Melcher, and Manuel L. Silva and were produced by the Department of Electrical Engineering and Computer Science at the Massachusetts Institute of Technology.\n\nThe purpose of these demonstrations is to make mathematical analysis of electromagnetism take on physical meaning. Based on relatively simple configurations and arrangements of equipment, they make a direct connection between what has been analytically derived and what is observed. They permit the student to observe physically what has been described symbolically. Often presented with a plot of theoretical predictions that are compared to measured data, these demonstrations give the opportunity to test the range of validity of the theory and present a quantitative approach to dealing with the physical world.\n\nThe short form of these videos contains the demonstrations only. The long form also presents theory, diagrams, and calculations in support of the demonstrations.\n\nThese videos are used in the courses [6.013/ESD.013J](/courses/6-013-electromagnetics-and-applications-spring-2009/) and [6.641](/courses/6-641-electromagnetic-fields-forces-and-motion-spring-2009/).\n",
  "department_numbers": [
    "6"
  ],
  "extra_course_numbers": "",
  "primary_course_number": "RES.6-001",
  "course_image_thumbnail": {
    "content": "e4112f97-5372-15d0-4628-b42f9be7ce15",
    "website": "res-6-001-electromagnetic-fields-and-energy-spring-2008"
  },
  "hide_download_original": false,
  "learning_resource_types": [
    "Open Textbooks",
    "Lecture Videos",
    "Problem Sets with Solutions"
  ],
  "site_uid": "633730f0-e5a7-42f9-bf3d-28ae8144f9a9",
  "site_short_id": "res.6-001-spring-2008",
  "site_url_path": "courses/res-6-001-electromagnetic-fields-and-energy-spring-2008",
  "title": "Course Metadata"
}